app/controllers/r_summary_by_month_controller.rb

SELECT * FROM `cim_stats_semester` WHERE (`cim_stats_semester`.`semester_desc` = 'Summer 2008') LIMIT 1
SELECT month_id, month_desc FROM `cim_stats_month` WHERE (`cim_stats_month`.`semester_id` = 6) ORDER BY month_id
SELECT * FROM `cim_stats_semester`
---
  def index
    if params[:semester].nil?
      @semesterID = nil
    else
      @semesterSelected = params[:semester]['semester']
      @semesterID = (CimStatsSemester.find_by_semester_desc @semesterSelected).semester_id
      @months = CimStatsMonth.find(:all, :select => 'month_id, month_desc', :conditions => { :semester_id => @semesterID }, :order => :month_id)
    end
    @semesters = CimStatsSemester.all.collect{ |s| [s.semester_desc]}