app/controllers/r_summary_by_week_controller.rb

SELECT * FROM `cim_stats_month` WHERE (`cim_stats_month`.`month_desc` = 'December 2006') LIMIT 1
SELECT month_number, month_calendaryear FROM `cim_stats_month` WHERE (`cim_stats_month`.`month_id` = 4)
SELECT week_id FROM `cim_stats_week` WHERE (`cim_stats_week`.`month_id` = 4) ORDER BY week_id
SELECT * FROM `cim_stats_month`
---
  def index
    if params[:month].nil?
      @monthID = nil
    else
      @monthSelected = params[:month]['month']
      @monthID = (CimStatsMonth.find_by_month_desc @monthSelected).month_id
      @weeks = CimStatsWeek.find(:all, :select => :week_id, :conditions => { :month_id => @monthID }, :order => :week_id)
    end
    @months = CimStatsMonth.all.collect{ |m| [m.month_desc]}